{"intro":
	{
		"title":"Bradley Wiggins",
		"text":"A senior <b>Systems Designer / Programmer</b> who has fought fires in the development trenches for a wide breadth of games, of diverse genres, aimed at any player demographic. Past titles include award winning action games, massively popular social games, benchmark-setting designs made on challenging new platforms, and even intelligent toys.<p>Brad has a mixed skill-set including <b>a background in</b> both <b>programming and art</b> disciplines. Brad is able to code in C, C++, C#, PHP, and many other languages, as well as make mock visual assets and concept sketches. This is useful not only for interacting with assets of either discipline, but also understanding the technical and stylistic constraints that each system needs to exist in.<p>As a designer on many small-team projects, Brad has been tasked with handling many areas of design, such as <b>Systems Design</b>, <b>Content Design</b>, <b>Level Design</b>, <b>Narrative Design</b>, <b>UI design</b>, and even the occasional project manager tasks. Brad can wear multiple hats, and contributes in many branches of development (including voice acting), but also is quick to find a unique specialty, when working with a team of other designers.<p><b>Brad.Wiggins@gmail.com</b>"
	},
"skillset":
	[{
		"title":"Programmer Designer",
		"image":"design.jpg",
		"text":"Designer by profession, but education focused on computer science. In particular studying C/C++, java, Assembly languages, PHP, SQL, and various APIs. Continued to study and use many other languages and tools, such as C#, actionscript, and javascript.<p>This technical interest and skillset serves not just in the ability to script or program prototypes or game variables, but to also understand the technical needs and limitations of engineer team-members."
	},
	{
		"title":"Live Ops & Analytics",
		"image":"metrics.jpg",
		"text":"Working at Zynga is like working at the NASA of social games. All roles are expected to understand use data queries to justify their work. Live metrics were even displayed on giant monitors throughout the office.<p>The experience at Digital Chocolate also demanded daily analytics tracking... used for rapid design iteration to diagnose and improve specific key metrics chosen per weekly sprint, including huge gains for tutorial completion rate and ARPU during soft launch."
	},
	{
		"title":"Social-Game Economy Modeling",
		"image":"energy.jpg",
		"text":"Experience building complex data-models for many large-economy games. Accurately predicted player progress when compared to post-launch numbers, on many titles. Put in charge of Farmville 2 limited time item and recipe pricing."
	},
	{
		"title":"Brainstorming & Creative Consult",
		"image":"idea.jpeg",
		"text":"Skilled in \"tangential thought\", and able to produce a great quantity and quality of ideas upon request, even under constraints.<p>Often special requested to join other teams' brainstorming, and was even the only designer asked at SK planet, to participate in all of the company's creative meetings. Eager to be included in any creative problem solving work, and quick to become an excited advocate for the goals of the project."
	},
	{
		"title":"Unity Development",
		"image":"unity-logo.png",
		"text":"Proficient in C#, and able to use unity for quick prototyping, as well as tuning game variables in an existing project. Experience working on many professional as well as personal Unity projects, and is very confident with the tool, and where / how to find solutions to new problems."
	},
	{
		"title":"Prototypes & Pitches",
		"image":"youme.jpg",
		"text":"Able to deliver the highest quality pitches and prototypes for new projects, on regular intervals and within specified guidelines. This was an especially large responsibility at Namco, where the company was trying to find its direction as an aspiring original IP creator.<p>Eagerly embraces paper-prototyping as a powerful tool when deadlines are especially tight."
	},
	{
		"title":"Rapid Development",
		"image":"ratchet.jpg",
		"text":"Has a background in agile development, or just short production cycles in general. Mobile games tend to have very rushed development schedules, but developing features for farmville 2 was even shorter, and each designer was developing 2 or more simultaneously."
	},
	{
		"title":"Mobile Games",
		"image":"nh.jpg",
		"text":"Has designed award-winning mobile games since 2004… long before the arrival of smartphones and carrier independent application storefronts.<p> Though controls and marketing has changed, much of players’ expectations has not. An intimate understanding of mobile play patterns and player desires, is still required to do well."
	},
	{
		"title":"Zynga Learnings",
		"image":"Farmville-2-zynga.jpg",
		"text":"Fail fast! Was the motto at Zynga. Fight for great ideas... but quickly recognize and abandon what isn't working. Life at Zynga was nearly constant crunch, there was no time to afford indecision.<p>Product managers and Designers worked closely on every feature, and learned not only to trust each others' expertise, but also to pick up a little of each others' discipline. Zynga designers were responsible for a great deal of metrics gathering and presenting numerical analysis to creative stakeholders."
	},
	{
		"title":"Adapting IP",
		"image":"snoopy.jpg",
		"text":"Has wide experience adapting existing IP for games, including award winning titles at Handheld Games for Sony and Disney, and porting many legacy titles at Namco.<p>Namco responsibilites included regularly pitching mobile adaptations of existing licenses, as well as thoroughly documenting legacy japanese phone games, for porting."
	},
	{
		"title":"Pixel Art",
		"image":"sf.jpg",
		"text":"Able to produce high-quality pixel-art sprites and animation for retro themed projects. Has a vast background in working with low-resolution projects from both a design and programing standpoint, as well as a personal passion for the style. "
	},
	{
		"title":"Audio Interfaces & Toys",
		"image":"Professor.jpg",
		"text":"Designed, implemented, and tested the audio-only menu system for interacting with Einstein intelligent robot, when a mobile phone was not connected. This task required spending three months in Hong Kong, working directly with the robot firmware engineers and prototype units, to execute the team's standard for quality."
	},
	{
		"title":"Web Technologies",
		"image":"cape-whoopies.jpg",
		"text":"Skill in PHP, SQL, HTML, CSS, javascript and other technologies. This is of great value for designing and building websites (including the one you are looking at now), maintaining design wikis, as well as web related tools, analytics queries."
	},
	{
		"title":"Voice & Recording",
		"image":"voice.png",
		"text":"Has performed as announcer on projects, as well as playing harmonica and other SFX. Experienced with recording and performing. Additional experience participating in the composition of a looping background song."
	},
	{
		"title":"Documentation",
		"image":"documentation.jpg",
		"text":"Writes verbose Game Design Documents, brief feature rundowns in powerpoint, or vast game development wikis. A great deal of time at Namco was spent thoroughly documenting existing classic titles, in preparation for porting."
	}
],
"awards":
	[{
		"title":"Ratchet & Clank: Going Mobile",
		"award":"Wireless Platformer of the Year 2005",
		"from":"Editor's Choice - IGN",
		"role":"Designer"
	},
	{	
		"title":"Ratchet & Clank: Going Mobile",
		"award":"Wireless Platformer of the Year 2005",
		"from":"Player's Choice - IGN",
		"role":"Designer"
	},
	{	
		"title":"Ratchet & Clank: Going Mobile",
		"award":"Best Action Game 2005",
		"from":"Mobies Awards - Gamespot",
		"role":"Designer"
	},
	{
		"title":"Snoopy the Flying Ace",
		"award":"Best Casual Game 2007",
		"from":"Wireless Gaming World",
		"role":"Designer"
	}],
"accomplishments":
	[{
		"title":"Farm2 - Highest Revenue Day",
		"image":"rabbitwarren.png",
		"text":"Designer of the rabbit warren feature. This feature’s launch, marked Farmville 2’s highest revenue day. Player’s were motivated by the exciting and fun rewards that were designed for this feature.<p>Having seen a weakness in the appeal of recently introduced “premium crops”, I took initiative to introduce a truly desirable premium crop (the purple dragon carrot), which not only did better supported that feature, but also gave ample motivation to engage with and complete the prerequisite rabbit warren tasks. <p>The feature also included a unique interactive decoration, that allowed your stored rabbits to pop up in individually placed rabbit holes. This set the new bar for premium crops, and continued my trend of unique and engaging farm decorations. I was personally very proud of this feature, and personally commissioned a purple dragon carrot cake to be made and brought to the office for celebration of the feature’s launch."
	},{
		"title":"Ratchet & Clank: Going Mobile",
		"image":"ratchet_group.png",
		"text":"Ratchet & Clank was both a critical and commercial success, winning many awards, including two game of the year awards from IGN. In its old age, it continues to get internet attention from people who find emulatable versions online.<p>Ratchet & Clank was an iteration on my previous success with “Spider-Man 2: The Hero Returns”, which our publishers at Sony thought well enough of, that they specifically asked for me to be assigned as the designer on this project. Despite having no interaction with Insomniac, I designed and helped deliver a very faithful adaptation of the franchise.<p>Responsibilities included:<ul><li>Designing the tilesets, and building levels form them</li><li>Planning and maintaining the asset-list</li><li>Designing the weapons, enemies, and bosses</li><lI>Writing much of the dialog</li><li>Working with the composer on SFX and music</li><li>Running morning standups</li><li>Negotiating deliverable features with the publisher</li></ul>"
	},{
		"title":"Farm2 - Fence Engagement and Monetization",
		"image":"mudwallowfinal.png",
		"text":"Designer of the Mud Wallow feature, which successfully monetized fences for the very first time. Although premium fences had been offered before, they never generated meaningful revenue. This feature succeeded in part due to its especially creative and engaging thematic decorations.<p>The mud wallow gave players a building with incorporated fences, that could connect to other fences a player owns. Combined with the decorative mud plots, players could make a massive muddy pig enclosure, that pigs spent all day roaming and rolling in. <p>This was the first feature where I felt that I had found my unique specialty among the team’s designers, as creating especially novel decoration items, to attract greater player engagement."
	},{
		"title":"Smartphone launch titles",
		"image":"iphone2007.png",
		"text":"Worked on iPhone and android adaptations of Namco titles, in secret, before the announcement of either phone. These included Pac-Man and Ms Pac-Man, which were planned for - and successfully released as - launch titles for both phones. Using prototype devices, I designed and tuned the “swipe” style controls for the game.<p>While working on these projects, I had to become the company expert on Apple’s iOS style guide, and was asked to create a Namco internal smartphone terminology and best practices guide. This guide included much of apple’s design requirements, touch screen practices and terminology, but also accelerometer practices and terminology (which was all new to mobile games, at the time)."
	},{
		"title":"Snoopy the Flying Ace",
		"image":"snoopy_group.png",
		"text":"Snoopy is a truly one button feature-phone game released in 2007, vastly predating flappy bird, and based on the peanuts license. Another team had made a previous attempt at a snoopy flying game, that didn’t work out… and I was asked to come up with a new direction. I was inspired by simple “helicopter” flash games (which play much like flappy bird) but wanted to add a more gentle curve to the motion, giving the sensation of pulling up from a dive, and of gently gliding.<p>Snoopy played great and was very novel for its time (selling well and winning at least one award). But the biggest compliment was that in 2011, ustwo released “Whale Trail” for iPhone… which replicates many of Snoopy’s uncommon mechanics, and suggests that the developers were using it as reference (if not also big fans). Examples of shared mechanics include: parabolic flight, trails of collectables, storm cloud obstacles, gusts, and looping."
	},{
		"title":"Namco Game Prototypes",
		"image":"namco_pitches.png",
		"text":"Namco was eager to create original feature-phone titles for some of the licenses they owned (or could easily aqcuire), and gave their designers the responsibility to make pitches each week for a different predefined license or theme. Several of my pitches were very well received by management, but the company lacked the courage to follow through with their plan, when classic ports were still reliable. Ask me about Chi-Burger!<p>In advance of Pac-Man’s 30th anniversary, Namco held an internal competition for all employees to pitch their ideas for a new take on Pac-Man for mobile (at a company with hundreds of testers). My ghost puzzler pitch was one of three favorites selected, and the only pitch to be prototyped."
	}],
"testimonials":
	[{
		"quote":"Brad has a great ability to think \"outside the box\" and come up with unique design solutions where others would stick with the tried and tired. He is passionate, patient and enthusiastic about his work as a designer, and not afraid to commit to long hours to get a job done. <b>His humor and personality bring morale up in any work environrnent</b> and he is constantly looking for new ways to bring his team members together.",
		"author":"Seth Rosenfeld",
		"role":"Executive Producer at Handheld Games"
	},
	{
		"quote":"Working with Brad was a joy from day 1. The moment he stepped foot in our offices, he was constantly trying to find new ways to improve the game we were working on. Brad is very professional when it comes to his job, and the tireless hours he kept while designing the best possible game were a testament to his dedication. <b>He did all of this while still keeping morale high with his sense of humor and artistic wit.</b>",
		"author":"David McCormick",
		"role":"Senior Producer at Zynga"
	},
	{
		"quote":"Brad is my favorite designer I have ever worked with because he makes my life easier. He doesn't seem to have an ego. If there are decisions that come from above which he doesn't necessarily agree with, <b>he can always design a solution that satisfies the client, our own boss, and still manages to use art that was on the chopping block.</b>",
		"author":"Peter Thurwachter",
		"role":"Art Director at Handheld Games"
	},
	{
		"quote":"The collaborative process is always fun and fruitful with Brad. He is able to not only quickly understand the goals and direction of a product, but also imagine it from fresh and inventive perspectives. He has a thorough grasp of high level concepts for what makes games engaging and is able to come up with new ways to present that to the player. Brad's work, work ethic, and amiable nature made it a pleasure to collaborate.",
		"author":"Steve Abeyta",
		"role":"Creative Director at SK Planet"
	},
	{
		"quote":"He's always trying to push the envelope within the constrains that are given and has done so with great success. His novel ideas have now become standard practice on cadence features and will continue to delight users and drive product results. Brad would be a great addition to any team big or small and any type of game on any platform.",
		"author":"Taylor John",
		"role":"Senior Game Designer at Zynga"
	},
	{
		"quote":"In addition to displaying a passion for games and game design, Brad consistently displayed a high-level of creativity, artistic vision and a great capacity for the creation of game concepts. He is bright, friendly and good natured.",
		"author":"Marcela Cabrera",
		"role":"Art Director at Namco Networks"
	},
	{
		"quote":"His approachable and fun attitude broke down barriers between departments which lead to a much smoother production processes. Brad's technical ability far out-shined his peers. It was always enjoyable to be able to talk about high end development and know that Brad could comprehend and add to the conversation.",
		"author":"Jake Torset",
		"role":"Director of Development at Handheld Games"
	},
	{
		"quote":"Brad Wiggins is a genuinely talented game creator. He is able offer a variety of viable solutions to design problems while maintaining a consistent vision of quality and fun in the end-user experience. While Brad is not afraid to speak his mind, his ideas are communicated with a sense of humility and honesty; effectively inviting other team members to express their opinions.",
		"author":"Wes McKiel",
		"role":"Game Designer at Namco Networks"
	},
	{
		"quote":"Whilst having total confidence in his original ideas, Brad is capable of coming up with equally wonderful alternatives which can ease his team's workload under tight deadlines. In the hectic world of game development, it is crucial yet rare that people in a team maintain calm, positive attitudes towards one another – Brad possesses this precise valuable quality.",
		"author":"Kathy Li",
		"role":"Engineer at Namco Networks"
	},
	{
		"quote":"Despite constant creative interference from the publisher, Brad was able to design mobile games that stayed true to their source material and were actually fun to play despite the limited controls available to the mobile phones of the day. I would work with him again given the chance.",
		"author":"Ben Hopper",
		"role":"Animator at Handheld Games"
	},
	{
		"quote":"Brad's one of the best game designers I have had the privilege of working with. He has a strong understanding of all the pieces involved in modern game creation, from the top, producer-level, to the programming, to the 2D/3D art elements. Armed with this knowledge, he is skilled at designing clever, fun gameplay mechanics that make the most of the technology available in the target hardware, while also taking advantage of the skill sets he has on his team.",
		"author":"David Howe",
		"role":"Game Designer at Handheld Games"
	},
	{
		"quote":"Brad's blended skillset of being an artist, engineer, and game designer allows him to express and implement his creative vision in ways most people aren't able to without having a bigger team and budget.<p>He is a great collaborator and fits in well with any team, and his understanding of games comes across in every facet of his work when he is diligently making new little worlds for people to play in.",
		"author":"Joseph Hatcher",
		"role":"Tech Support Supervisor at Perfect World"
	},
	{
		"quote":"When it comes to designers with a bag of tricks, Brad was the guy. I feel that his many facets and talents in the day to day really played a heavy part in the way he approached game design. It wasn't just about getting the job done, which was obviously second nature, but rather trying to approach the solution from many angles so as to provide different paths to reach the same solution of \"get 'ir done\".",
		"author":"Alexander Shen",
		"role":"Associate Producer at Namco Networks"
	},
	{
		"quote":"There is a saying \"A great talent find happiness in execution\". There are very few people like Brad. Talented, Inspiring and Creative with such a subtle yet lasting impression and strong delivery. There is no doubt in my mind that Brad is an excellent designer as he has shown in his work ethic and daily presense.",
		"author":"Jonathan Pasamonte",
		"role":"Assistant QA Lead at Namco Networks"
	},
	{
		"quote":"Brad was a constant source of innovative and fun ideas not only in his approach to game design but in his social interactions as well. I had the opportunity to work with Brad across several small projects that all needed to be complete at the same time. On these projects his design was always clear and organized, creating an end product that was rewarding and memorable experience. I feel that Brad would be an amazing addition to any development team.",
		"author":"James Lutz",
		"role":"Animator at Handheld Games"
	},
	{
		"quote":"Brad was awesome to work with. He had some really great ideas that turned into some really great features. I would definitely recommend him and his skills to anyone.",
		"author":"Ryan Stark",
		"role":"Senior 2d Artist at Zynga"
	},
	{
		"quote":"Brad is hard-working, whipping up a level editor for our game in short order, and has a good balance of an artistic and technical mind. We would often discuss technical issues and how to fix them, but also sketch out character ideas and level layout.",
		"author":"Doug DaSilva",
		"role":"Classmate at Digipen"
	}],
"projects":
	[{
		"image":"einstein.jpg",
		"title":"Intelligent Einstein (Toy)",
		"company":"Side Dish Productions",
		"Year":"2017"
	},{
		"image":"stein.jpg",
		"title":"Stein-O-Matic",
		"company":"Side Dish Productions",
		"Year":"2017"
	},{
		"image":"so.jpg",
		"title":"Star Ops",
		"company":"Regicide Games",
		"Year":"(unreleased)"
	},{
		"image":"sf.jpg",
		"title":"Star Force",
		"company":"Regicide Games",
		"Year":"(unreleased)"
	},{
		"image":"blis.jpg",
		"title":"Blister",
		"company":"Regicide Games",
		"Year":"(unreleased)"
	},{
		"image":"ymw.jpg",
		"title":"YouMeWar",
		"company":"SK Planet",
		"Year":"2014"
	},{
		"image":"ymv.jpg",
		"title":"YouMeVerse",
		"company":"SK Planet",
		"Year":"2014"
	},{
		"image":"q.jpg",
		"title":"Time Team<br>(unreleased)",
		"company":"SK Planet",
		"Year":"2014"
	},{
		"image":"fv2.jpg",
		"title":"Farmville 2",
		"company":"Zynga",
		"Year":"2012"
	},{
		"image":"q.jpg",
		"title":"Rich Dad Poor Dad (unreleased)",
		"company":"XeoDesign",
		"Year":"2011"
	},{
		"image":"seeds.jpg",
		"title":"Seeds (unreleased)",
		"company":"Seeds",
		"Year":"2011"
	},{
		"image":"nh.jpg",
		"title":"NightHaven",
		"company":"Digital Chocolate",
		"Year":"2011"
	},{
		"image":"pg.jpg",
		"title":"Perfect Getaway",
		"company":"Perfect World",
		"Year":"2010"
	},{
		"image":"st.jpg",
		"title":"Facebook game<br>prototype",
		"company":"Funtinue",
		"Year":"2009"
	},{
		"image":"iso.jpg",
		"title":"Flash game<br>prototype",
		"company":"Funtinue",
		"Year":"2009"
	},{
		"image":"ss.jpg",
		"title":"Game-Maker<br>prototype",
		"company":"Funtinue",
		"Year":"2008"
	},{
		"image":"alpine.jpg",
		"title":"Alpine Racer",
		"company":"Namco",
		"Year":"2008"
	},{
		"image":"rr.png",
		"title":"Ridge Racer Zeebo",
		"company":"Namco",
		"Year":"2008"
	},{
		"image":"sub.jpg",
		"title":"Submerged",
		"company":"Namco",
		"Year":"2008"
	},{
		"image":"pp.jpg",
		"title":"Pole Position<br>(iPhone)",
		"company":"Namco",
		"Year":"2008"
	},{
		"image":"pmag.jpg",
		"title":"Pac-Man Arcade Golf",
		"company":"Namco",
		"Year":"2008"
	},{
		"image":"gp.jpg",
		"title":"Pac-Man Ghost Prototype",
		"company":"Namco",
		"Year":"2007"
	},{
		"image":"mspac.jpg",
		"title":"Ms Pac-Man<br>(iPhone & Android)",
		"company":"Namco",
		"Year":"2007"
	},{
		"image":"pac.jpg",
		"title":"Pac-Man<br>(iPhone & Android",
		"company":"Namco",
		"Year":"2007"
	},{
		"image":"snoopy.jpg",
		"title":"Snoopy the Flying Ace",
		"company":"Namco",
		"Year":"2006"
	},{
		"image":"petshop.jpg",
		"title":"Littlest Pet Shop",
		"company":"Handheld Games",
		"Year":"2006"
	},{
		"image":"zorro.jpg",
		"title":"The legend of Zorro",
		"company":"Handheld Games",
		"Year":"2006"
	},{
		"image":"shrek.jpg",
		"title":"Shrek / Over the Hedge 5-in-1",
		"company":"Handheld Games",
		"Year":"2006"
	},{
		"image":"pixar.jpg",
		"title":"Pixar Classics 5-in-1",
		"company":"Handheld Games",
		"Year":"2006"
	},{
		"image":"ratchet.jpg",
		"title":"Ratchet & Clank: Going Mobile",
		"company":"Handheld Games",
		"Year":"2005"
	},{
		"image":"sm2.jpg",
		"title":"Spider-man 2: The Hero Returns",
		"company":"Handheld Games",
		"Year":"2005"
	},{
		"image":"gb.jpg",
		"title":"Ghost Busters",
		"company":"Handheld Games",
		"Year":"2005"
	},{
		"image":"nick.jpg",
		"title":"Nicktoons 5-in-1",
		"company":"Handheld Games",
		"Year":"2004"
	},{
		"image":"daffy.jpg",
		"title":"Spaced Out Duck",
		"company":"Handheld Games",
		"Year":"2004"
	},{
		"image":"bugs.jpg",
		"title":"Bugs Bunny Carrot Quest",
		"company":"Handheld Games",
		"Year":"2004"
	},{
		"image":"tweety.jpg",
		"title":"Hyde and Go Tweet",
		"company":"Handheld Games",
		"Year":"2004"
	},{
		"image":"q.jpg",
		"title":"Trick Shot Golf",
		"company":"Digipen Student Project",
		"Year":"2003"
	},{
		"image":"ffs.jpg",
		"title":"Fist of Fury Special",
		"company":"Hobby Project",
		"Year":"2003"
	},{
		"image":"b&t.jpg",
		"title":"Black & Tan",
		"company":"Digipen Student Project",
		"Year":"2002"
	},{
		"image":"ltn.jpg",
		"title":"Love Thy Neighbor",
		"company":"Digipen Student Project",
		"Year":"2001"
	},{
		"image":"ck.jpg",
		"title":"Conquered Kingdoms",
		"company":"Digipen Student Project",
		"Year":"2000"
	}],
	"employment":
	[{
		"company":"Side Dish Productions",
		"logo":"sidedish.jpg",
		"role":"Contract Design",
		"description":""
	},{
		"company":"Regicide Games",
		"logo":"regicidelogo.png",
		"role":"Creative Lead"
	},{
		"company":"SK Planet",
		"logo":"sk.png",
		"role":"Senior Designer"
	},{
		"company":"Zynga",
		"logo":"Zynga_logo.jpg",
		"role":"Designer"
	},{
		"company":"Seeds",
		"logo":"seeds.jpg",
		"role":"Contract Design"
	},{
		"company":"XeoDesign",
		"logo":"xeo.png",
		"role":"Contract Design"
	},{
		"company":"Digital Chocolate",
		"logo":"dc.jpg",
		"role":"Designer"
	},{
		"company":"Perfect World Entertainment",
		"logo":"logo-pwe.png",
		"role":"Designer"
	},{
		"company":"Funtinue",
		"logo":"",
		"role":"Creative Lead"
	},{
		"company":"Namco",
		"logo":"namco.jpg",
		"role":"Designer"
	},{
		"company":"Handheld Games",
		"logo":"hhg.png",
		"role":"Designer"
	}]
}